
// Возвращает структуру типов контекта по расширению
//
// Возвращаемое значение:
//   Структура
//		Ключ 		- расширение
//		Значение	- тип данных контента
// 
Функция content_types() Экспорт
	Структура = Новый Структура;
	Структура.Вставить("bmp"	, "image/bmp");
	Структура.Вставить("ico"	, "image/x-icon");
	Структура.Вставить("gif"	, "image/gif");
	Структура.Вставить("png"	, "image/png");
	Структура.Вставить("jpg"	, "image/jpeg");
	Структура.Вставить("jpeg"	, "image/jpeg");
	Структура.Вставить("svg"	, "image/svg+xml");
	Структура.Вставить("tiff"	, "image/tiff");
	
	Структура.Вставить("pdf"	, "application/pdf");
	Структура.Вставить("odt"	, "application/vnd.oasis.opendocument.text");
	Структура.Вставить("ppt"	, "application/vnd.ms-powerpoint");
	Структура.Вставить("doc"	, "application/msword");
	Структура.Вставить("xls"	, "application/vnd.ms-excel");
	
	Структура.Вставить("pptx"	, "application/vnd.openxmlformats-");
	Структура.Вставить("docx"	, "application/vnd.openxmlformats-");
	Структура.Вставить("xlsx"	, "application/vnd.openxmlformats-");
	
	Структура.Вставить("txt"	, "text/plain");

	Возврат Структура;
КонецФункции

// Возвращает соответствие статусов контента
//
// Параметры:
//	Ключ1С - Булево - использовать ключом имя 1С
//
// Возвращаемое значение:
//   Структура
//		удален		- trashed
//		устарел		- historical
//		черновик	- draft
//		текущий		- current
//		любой		- any
// 
Функция content_status(знач Ключ1С = Ложь) Экспорт
	Структура = Новый Структура;
	
	ВставитьЗаписьСтруктуры(Структура, "удален"		, "trashed"		, Ключ1С);
	ВставитьЗаписьСтруктуры(Структура, "устарел"	, "historical"	, Ключ1С);
	ВставитьЗаписьСтруктуры(Структура, "черновик"	, "draft"		, Ключ1С);
	ВставитьЗаписьСтруктуры(Структура, "текущий"	, "current"		, Ключ1С);
	ВставитьЗаписьСтруктуры(Структура, "любой"		, "any"			, Ключ1С);
	
	Возврат Структура;
КонецФункции

// Возвращает структуру настроек базы знаний
//
// Параметры:
//	АдресСервера - Строка - адрес сервера, например https://<ВашДомен>.atlassian.net
//
// Возвращаемое значение:
//   Структура
//		АдресСервера			- Строка - адрес сервера в нижнем регистре
//		ЗащищенноеСоединение	- Булево - признак защищенного соединения (используется https)
//		СерверHTTP				- Строка - сервер для использования при подключении (<ВашДомен>.atlassian.net)
//		АдресWiki				- Строка - полный адрес базы знаний на сервере (https://<ВашДомен>.atlassian.net/wiki)
// 
Функция url_params(знач АдресСервера) Экспорт
	Схема = "";
	Адрес = "";
	
	АдресСервера = НРег(СокрЛП(АдресСервера));
	
	Позиция = СтрНайти(АдресСервера, "://");
	Если Позиция > 0 Тогда
		Схема = НРег(Лев(АдресСервера, Позиция - 1));
		Адрес = Сред(АдресСервера, Позиция + 3);
	КонецЕсли;
	
	АдресСервераHTTP = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(Адрес, "/", "Справа");
	
	АдресWiki = АдресСервера + ?(СтрЗаканчиваетсяНа(АдресСервера, "/"), "", "/") + "wiki";
	
	РеквизитыСсылки = Новый Структура;
	РеквизитыСсылки.Вставить("АдресСервера"			, АдресСервера);
	РеквизитыСсылки.Вставить("ЗащищенноеСоединение"	, (Схема = "https"));
	РеквизитыСсылки.Вставить("СерверHTTP"			, Адрес);
	РеквизитыСсылки.Вставить("АдресСервераWiki"		, АдресWiki); 
	 
	Возврат РеквизитыСсылки;
КонецФункции

#Область СлужебныеПроцедурыИФункции
 
Процедура ВставитьЗаписьСтруктуры(Коллекция, знач Имя1С, знач ИмяConfluence, знач Ключ1С)
	Если Ключ1С = Истина Тогда
		Коллекция.Вставить(Имя1С, ИмяConfluence);
	Иначе 
		Коллекция.Вставить(ИмяConfluence, Имя1С);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
