
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.АдресСервера = "https://progtb.atlassian.net";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПространства(Команда)
	ЭтотОбъект.Пространства.Очистить();
	
	НастройкиПодключения	= confluence_ApiClientServer.get_connection_settings(Объект.АдресСервера);
	ПараметрыЗапроса		= confluence_ApiClientServer.get_all_spaces_params(0, 0); 
	
	РезультатЗапроса = confluence_ApiClientServer.get_all_spaces(НастройкиПодключения, ПараметрыЗапроса); 
	Если confluence_ApiClientServer.check_error(РезультатЗапроса, Истина) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтруктураРаздела Из РезультатЗапроса.Значения Цикл
		НоваяСтрока = ЭтотОбъект.Пространства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураРаздела,, "Метки");
		Для Каждого СтруктураМетки Из СтруктураРаздела.Метки Цикл
			СтрокаМетки = НоваяСтрока.Метки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаМетки, СтруктураМетки);
		КонецЦикла;
		
		НоваяСтрока.СсылкаПросмотр = НастройкиПодключения.АдресСервераWiki + СтруктураРаздела.ДомашняяСтраница.Ссылки.Просмотр;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПространстваПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.Пространства.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущиеДанные.СсылкаПросмотр) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтотОбъект.ПолеHTML = ТекущиеДанные.СсылкаПросмотр;
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
