
#Область ПрограммныйИнтерфейс_ВремяВСекунды

// Возвращает число секунд в месяце
//
// Параметры:
//	ЧислоДней - Число - по умолчанию 30
//
// Возвращаемое значение:
//   Число
// 
Функция МесяцВСекундах(знач ЧислоДней = 30) Экспорт
	Возврат ЧислоДней * ДеньВСекундах();
КонецФункции

// Возвращает число секунд в неделе
//
// Возвращаемое значение:
//   Число
// 
Функция НеделяВСекундах() Экспорт
	Возврат 7 * ДеньВСекундах();
КонецФункции

// Возвращает число секунд в дне
//
// Возвращаемое значение:
//   Число
// 
Функция ДеньВСекундах() Экспорт
	Возврат 24 * ЧасВСекундах();
КонецФункции

// Возвращает число секунд в часе
//
// Возвращаемое значение:
//   Число
// 
Функция ЧасВСекундах() Экспорт 
	Возврат 3600;
КонецФункции

#КонецОбласти
