#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьНастройкиВХранилище(знач Настройки) Экспорт
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработки.confluence_БазаЗнаний",
		"ЗначенияРеквизитов",
		Настройки,
		НСтр("ru='Значения реквизитов формы для заполнения.'")); 
	
КонецПроцедуры
	
Функция ПолучитьНастройкиИзХранилища() Экспорт
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработки.confluence_БазаЗнаний",
		"ЗначенияРеквизитов",
		СтруктураНастроек());
	
КонецФункции

Функция СтруктураНастроек() Экспорт
	Структура = Новый Структура;
	Структура.Вставить("АдресСервера"				, "");
	Структура.Вставить("ОткрыватьВнешниеСсылкиВ1С"	, Ложь);
	Структура.Вставить("ИдентификаторРаздела"		, "");
	Структура.Вставить("СкрытьПолеВводаРаздела"		, Ложь);
	
	Возврат Структура;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
#КонецОбласти

#Область ОбновлениеИнформационнойБазы
#КонецОбласти

#Область ИнтернетСервис
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#Область Печать
#КонецОбласти

#КонецЕсли 