#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьНастройкиВХранилище(знач Настройки) Экспорт
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработки.confluence_БазаЗнаний",
		"ЗначенияРеквизитов",
		Настройки,
		НСтр("ru='Значения реквизитов формы для заполнения.'")); 
	
КонецПроцедуры
	
Функция ПолучитьНастройкиИзХранилища() Экспорт
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработки.confluence_БазаЗнаний",
		"ЗначенияРеквизитов",
		СтруктураНастроек());
	
КонецФункции

Процедура НастройкиВОбъектФормы(знач ОбъектФормы, знач НастройкиФормы) Экспорт
	Настройки = СтруктураНастроек();
	ЗаполнитьЗначенияСвойств(Настройки, НастройкиФормы);
	
	ЗаполнитьЗначенияСвойств(ОбъектФормы, Настройки,, "ДоступныеСтраницы");
	
	ОбъектФормы.ДоступныеСтраницы.Очистить();
	
	Для Каждого СтруктураСтроки Из Настройки.ДоступныеСтраницы Цикл
		СтрокаТаблицы = ОбъектФормы.ДоступныеСтраницы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураСтроки);
	КонецЦикла;
КонецПроцедуры

Функция НастройкиИзОбъектаФормы(знач ОбъектФормы) Экспорт
	Настройки = СтруктураНастроек();
	ЗаполнитьЗначенияСвойств(Настройки, ОбъектФормы,, "ДоступныеСтраницы");
	
	МассивСтрок = ОбщегоНазначения.ТаблицаЗначенийВМассив(ОбъектФормы.ДоступныеСтраницы.Выгрузить());
	Настройки.ДоступныеСтраницы = МассивСтрок;
	
	Возврат Настройки;
КонецФункции

Функция СтруктураНастроек() Экспорт
	Структура = Новый Структура;
	Структура.Вставить("АдресСервера"				, "");
	Структура.Вставить("ОткрыватьВнешниеСсылкиВ1С"	, Ложь);
	Структура.Вставить("КлючПространства"			, "");
	Структура.Вставить("СкрытьПолеВводаРаздела"		, Ложь);
	Структура.Вставить("ДоступныеСтраницы"			, Новый Массив);
	
	Возврат Структура;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
#КонецОбласти

#Область ОбновлениеИнформационнойБазы
#КонецОбласти

#Область ИнтернетСервис
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#Область Печать
#КонецОбласти

#КонецЕсли 